Revit 2024 API
Railing.Flip Method
 Flips the railing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void Flip()
Visual Basic
Public Sub Flip
Visual C++
public:
void Flip()
Examples
CopyC#
private void FlipDefaultRailings(Stairs stairs)
{
    ICollection<ElementId> railingIds = stairs.GetAssociatedRailings();
    Transaction trans = new Transaction(stairs.Document, "Flip Railings");
    trans.Start();
    foreach (ElementId railingId in railingIds)
    {
        Railing railing = stairs.Document.GetElement(railingId) as Railing;
        if (railing.IsDefault == true)
        {
            railing.Flip();
        }
    }
    trans.Commit();
}
CopyVB.NET
Private Sub FlipDefaultRailings(stairs As Stairs)
    Dim railingIds As ICollection(Of ElementId) = stairs.GetAssociatedRailings()
    Dim trans As New Transaction(stairs.Document, "Flip Railings")
    trans.Start()
    For Each railingId As ElementId In railingIds
        Dim railing As Railing = TryCast(stairs.Document.GetElement(railingId), Railing)
        If railing.IsDefault = True Then
            railing.Flip()
        End If
    Next
    trans.Commit()
End Sub
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InapplicableDataException |  The railing has incorrect internal data.
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace